{"Does it cost money to open a brokerage account?": "No.", "Which brokerage firms are recommended?": "Do refer to our brokerage comparison and the brokerage guides that follows.Comparison of Brokerages: https://courses.thefulltimeinvestor.com/courses/fti-community-support/lectures/11569255Generally, use FSMOne for Singapore listed companies.Use Interactive Brokers (IB) for the rest of the world, because it's a single brokerage that can cover worldwide markets.If you wish to only invest in the US market only, then ThinkorSwim (ToS) by TDAmeritrade is a good option too.", "How to transfer asset holdings from one brokerage to another?": "For US listing, Automated Customer Account Transfer Service (ACATS) is the way to go.IB: https://www.interactivebrokers.com/en/software/am/am/funding/acatstransfers.htmToS: https://www.tdameritrade.com.sg/tdaa/index.html#!/whytdaa/faq/Most brokerages will have the steps or guides stated on their website. If not, can always call your broker to ask them to help facilitate.For any other transfer of companies from other exchanges, you can always call your brokers to ask for the details. They will be the best person to assist you on this.For lower fee when transferring from ToS to IB, and to keep your ToS account, you can do a partial transfer instead. Thanks to Bjorn for this tip!“You can actually do it without incurring the USD$75 full transfer fee. The trick is to use \"partial transfer\" as outgoing from ToS is free. Transfer out all your stocks/options/bonds and just leave some cash. Here are the steps with an example:You own 10 APPL & 20 FB shares, with $5,000 USD cash in ToS account currently.1) Once your IB account is approved, go Account Management -> Transfer & Pay -> Transfer Position.2) Choose Transaction Type: Inbound Position and Method: ACATS.3) Select \"thinkorswim by TD Ameritrade\", key in your Account Number & Account Type.4) Transfer all assets? Choose -> No (This means Partial Transfer).5) Add Asset -> Stock -> Symbol:FB -> Search.6) Quantity Type: Long, Transfer All? Yes.7) Do the same for APPL.8) Add Asset -> Cash -> Transfer All? No.9 Here's the trick. Key in any amount below USD$5,000. Eg. USD$4,999.10) Once completed, submit the ACATS and just wait.To ToS, anything less than your full account holdings constitutes a partial transfer. Hence for the above case, the effective transfer fee is just USD$1, which also helps to maintain and keep your ToS account active (Full transfer will close the account totally). Hope it helps!”", "Step by step guide for transferring assets in ThinkorSwim (ToS) Account to Interactive Brokers (IB) Account?": "For US listing, Automated Customer Account Transfer Service (ACATS) is the way to go.IB: https://www.interactivebrokers.com/en/software/am/am/funding/acatstransfers.htmToS: https://www.tdameritrade.com.sg/tdaa/index.html#!/whytdaa/faq/Most brokerages will have the steps or guides stated on their website. If not, can always call your broker to ask them to help facilitate.For any other transfer of companies from other exchanges, you can always call your brokers to ask for the details. They will be the best person to assist you on this.For lower fee when transferring from ToS to IB, and to keep your ToS account, you can do a partial transfer instead. Thanks to Bjorn for this tip!“You can actually do it without incurring the USD$75 full transfer fee. The trick is to use \"partial transfer\" as outgoing from ToS is free. Transfer out all your stocks/options/bonds and just leave some cash. Here are the steps with an example:You own 10 APPL & 20 FB shares, with $5,000 USD cash in ToS account currently.1) Once your IB account is approved, go Account Management -> Transfer & Pay -> Transfer Position.2) Choose Transaction Type: Inbound Position and Method: ACATS.3) Select \"thinkorswim by TD Ameritrade\", key in your Account Number & Account Type.4) Transfer all assets? Choose -> No (This means Partial Transfer).5) Add Asset -> Stock -> Symbol:FB -> Search.6) Quantity Type: Long, Transfer All? Yes.7) Do the same for APPL.8) Add Asset -> Cash -> Transfer All? No.9 Here's the trick. Key in any amount below USD$5,000. Eg. USD$4,999.10) Once completed, submit the ACATS and just wait.To ToS, anything less than your full account holdings constitutes a partial transfer. Hence for the above case, the effective transfer fee is just USD$1, which also helps to maintain and keep your ToS account active (Full transfer will close the account totally). Hope it helps!” ", "What is this American Depository Receipts (ADRs) pass-through fee that we need to pay for?": "Account holders maintaining positions in American Depository Receipts (ADRs) should note that such securities are subject to periodic fees intended to compensate the agent bank providing custodial services on behalf of the ADR. These services typically include inventorying the foreign stocks underlying the ADR and managing all registration, compliance and record-keeping services.Historically, the agent banks were only able to collect the custody fees by subtracting them from the ADR dividend, however, as many ADRs do not regularly pay dividends, these banks have been unable to collect their fees.As a result, in 2009, the Depository Trust Company (DTC) received SEC approval to begin collecting these custody fees on behalf of the banks for ADRs which do not pay periodic dividends. DTC collects these fees from its participant brokers (such as IB) who hold the ADRs for their clients. These fees are referred to as pass-through fees as they are designed to be then collected by the broker from its clients.If you hold a position in a dividend paying ADR, these fees will be deducted from the dividend as they have in the past. If you hold a position in an ADR which does not pay a dividend, this pass-through fee will be reflected on the monthly statement from your brokerage of the record date in which it is assessed.", "I’m opening my IB account now, should I choose cash or margin?": "Head to this link https://www.interactivebrokers.com/en/index.php?f=4945&p=configuring and choose the country you reside in, and see the difference between the benefits of cash and margin accounts. Preferably, go for a cash account because you do not want to run into situations where you do not have cash and the system lets you buy by borrowing money automatically.", "Why can’t I buy Singapore listed companies in Interactive Brokers (IB)?": "If you are Singaporean, then IB does not allow you to trade Singapore listed companies. It is likely an agreement with the Monetary Authority of Singapore (MAS), to protect the local brokerages so IB can be allowed into Singapore to operate.", "Is the GIM-ToS partnership for lower commissions still in force?": "Yes, just contact ToS to let them know you’re a graduate from GIM (Growth Investing Mastery).Can refer to our ToS guide here: https://courses.thefulltimeinvestor.com/courses/633329/lectures/11569318", "Some counters are listed as OTC and can't be bought on FSMOne. How do we go about purchasing such counters?": "OTC cannot be bought under FSMOne because it only has access to financial markets like NASDAQ and NYSE.If you wish to do so, consider using IB or ToS.", "Before the market opened, I saw the bid/ask spread was surprisingly wide. I'm wondering what you'd do in this situation seeing as not many people are buying now and the prices are very far apart?": "This might happen if the liquidity is low for that company. Likewise, it can be due to the bid and ask not being entered yet as the market has yet to open. You can wait for the market to open and see what is the actual bid/ask range.", "I have $X amount of capital, how to start investing?": "Do watch our Portfolio Management videos on the community portal. Those are guides for investors especially if you are new.Of course, if you are more experienced, or if your portfolio size is much larger, you might have to adjust accordingly.Ultimately, you invest when the company is quality and the valuation makes sense. Market timing is never easy and close to impossible.How much cash you hold on hand really depends whether there are opportunities around for you to invest in. Your cash build up should ideally come from additional cash you set aside from your other sources of income or when you sell companies that no longer fulfills your investment thesis.The max 15% cap need not apply to all companies, nor is it a hard limit.Eg. Can consider top 4 highest conviction companies at 15%, then next 4 at 10% for a total of 100% portfolio allocation.As you fund your portfolio with more cash from your savings over time, you can allocate accordingly.For beginners and those with small capital base (< $15 k), likely 3 to 4 companies. Build the position in each company over time as you have more capital to deploy.You don't want too few companies as Black Swan can and will happen, and certain companies might go bankrupt or just get sold off by the market.For those with a larger capital base to deploy at start (> $100 k), then recommendation is 5 to 8 companies.You do not want too many companies, otherwise it will be too hard and time consuming for you to monitor the changing fundamentals of the companies.No hard and fast rule for allocation, it depends on your comfort level.Can you sleep soundly at night knowing you only have 2 companies and are highly dependent on them?Are you comfortable with a large allocation to 1 company? Eg. 1 company is 50% of the portfolio.If the share price was to crash by 30% to 50% next week, will you still invest more in the company, assuming fundamentals are unchanged or maybe even improving?", "How much cash should I hold or should I be 100% vested?": "Do watch our Portfolio Management videos on the community portal. Those are guides for investors especially if you are new.Of course, if you are more experienced, or if your portfolio size is much larger, you might have to adjust accordingly.Ultimately, you invest when the company is quality and the valuation makes sense. Market timing is never easy and close to impossible.How much cash you hold on hand really depends whether there are opportunities around for you to invest in. Your cash build up should ideally come from additional cash you set aside from your other sources of income or when you sell companies that no longer fulfills your investment thesis.The max 15% cap need not apply to all companies, nor is it a hard limit.Eg. Can consider top 4 highest conviction companies at 15%, then next 4 at 10% for a total of 100% portfolio allocation.As you fund your portfolio with more cash from your savings over time, you can allocate accordingly.For beginners and those with small capital base (< $15 k), likely 3 to 4 companies. Build the position in each company over time as you have more capital to deploy.You don't want too few companies as Black Swan can and will happen, and certain companies might go bankrupt or just get sold off by the market.For those with a larger capital base to deploy at start (> $100 k), then recommendation is 5 to 8 companies.You do not want too many companies, otherwise it will be too hard and time consuming for you to monitor the changing fundamentals of the companies.No hard and fast rule for allocation, it depends on your comfort level.Can you sleep soundly at night knowing you only have 2 companies and are highly dependent on them?Are you comfortable with a large allocation to 1 company? Eg. 1 company is 50% of the portfolio.If the share price was to crash by 30% to 50% next week, will you still invest more in the company, assuming fundamentals are unchanged or maybe even improving?", "How much of my savings should I put in for my portfolio?": "It's good to use the capital you have on hand to build your wealth. You can always set aside a portion of your income from other sources, like your salary, to be used for investing.Some rules apply as usual.Do your financial management and budgeting to ensure your living expenses are well taken care of.Ensure you have proper financial protection coverage.Also have a reserve for emergency situations.Once these are taken care of, the additional cash can be safely deployed as investment capital.You do not need to invest immediately with the cash you set aside for investment each month. You can always set the capital aside while waiting for the right valuation to buy in.To aid in your planning process of how much you might need, do check out the Financial Planner.", "Can I ask for small companies that have illiquid stocks where it's hard to buy in, what actions should we take? Should Istill try to buy or forgo or just put it on the watchlist and wait?": "Depends on your comfort level and confidence in the company, as well as your capital size.Illiquid means it is hard to sell off if something goes wrong too. Likewise, if capital size is large and you can't allocate and buy the amount you want, it might be best to just set aside in a watchlist and consider other companies. Hopefully the liquidity issue becomes fixed over time (share split etc).If the company continues to perform and scale larger in terms of fundamentals, rest assured the market will get interested in it. If illiquid, likely share price might also move very fast.As for whether management might consider a move to improve the situation, it will depend. Likely if institutions start to take interest, they might attempt to influence management to do a share split so they can enter more comfortably or other forms of financing deals so they get a stake.Of course, management could be the one to do so via share split to attract large institutions too.", "When to sell?": "The same rule always applies, that is to sell when your investment thesis is no longer valid.", "How and when to do portfolio balancing? Or is there a need for portfolio balancing?": "As for portfolio balancing and reallocation, there are only three situations when you really need to do so.You reallocate when your investment thesis is no longer valid and therefore you need to sell the company away. Deploy the capital to other opportunities or hold the capital for now if there are none at the moment.You found a much better opportunity. Depending on your comfort level and capital size, you would likely hold a certain number of companies. Do refer to Portfolio Management. Eg. 6 companies. Therefore if you found another company that is way better than the existing 6 companies that you have, you should sell the 'weakest' and replace it with the better company.You are having issues sleeping soundly at night as certain companies now constitute too large a portion in your portfolio. Eg. 1 company constitute 40% of your portfolio. If this is the case, do reduce the position. Deploy the capital to other opportunities or hold the capital for now if there are none at the moment.You should rebalance if you have issues sleeping when a position becomes too big. These companies can still be quality companies so you should continue to hold it rather than sell them off. Just that you might want to readjust the weightage if you don’t feel comfortable.Need not deploy the capital immediately if valuation of other companies doesn’t make sense. Just hold the capital and wait for opportunity to deploy.Ultimately, you invest to grow your wealth but also for peace of mind.Do note that growth will inevitably slow down as company grows larger. Value of a company is driven ultimately by the amount of cash flow it can generate for you, discounted to today, over the remaining life of the company.Therefore, there are two major drivers for the growth in the value of the company, namelyThe returns it generates with the capital is uses. The RoE and RoIC measures this.The growth in revenue, earnings and cash flow. So, it depends mainly on the year on year growth in revenue assuming profit margin and cash flow margins are maintained.The bigger key value driver has always been more on RoE and RoIC. If the company can maintain its RoE and RoIC, which they should if it is still a quality company, then the company will continue to compound its value even if the revenue growth slows.Growth in revenue, earnings and cash flow serve to aid in boosting value growth more exponentially.With regards to share price change which sort of governs your returns in the end, besides the growth in the value of the company, the change in market valuation of price multiple will be another factor.You can refer to the Compounding Triangle about this.", "Should we sell a company if the growth is slowing but it is still a quality and solid company?": "The same rule always applies, that is to sell when your investment thesis is no longer valid.As for portfolio balancing and reallocation, there are only three situations when you really need to do so.You reallocate when your investment thesis is no longer valid and therefore you need to sell the company away. Deploy the capital to other opportunities or hold the capital for now if there are none at the moment.You found a much better opportunity. Depending on your comfort level and capital size, you would likely hold a certain number of companies. Do refer to Portfolio Management. Eg. 6 companies. Therefore if you found another company that is way better than the existing 6 companies that you have, you should sell the 'weakest' and replace it with the better company.You are having issues sleeping soundly at night as certain companies now constitute too large a portion in your portfolio. Eg. 1 company constitute 40% of your portfolio. If this is the case, do reduce the position. Deploy the capital to other opportunities or hold the capital for now if there are none at the moment.You should rebalance if you have issues sleeping when a position becomes too big. These companies can still be quality companies so you should continue to hold it rather than sell them off. Just that you might want to readjust the weightage if you don’t feel comfortable.Need not deploy the capital immediately if valuation of other companies doesn’t make sense. Just hold the capital and wait for opportunity to deploy.Ultimately, you invest to grow your wealth but also for peace of mind.Do note that growth will inevitably slow down as company grows larger. Value of a company is driven ultimately by the amount of cash flow it can generate for you, discounted to today, over the remaining life of the company.Therefore, there are two major drivers for the growth in the value of the company, namelyThe returns it generates with the capital is uses. The RoE and RoIC measures this.The growth in revenue, earnings and cash flow. So, it depends mainly on the year on year growth in revenue assuming profit margin and cash flow margins are maintained.The bigger key value driver has always been more on RoE and RoIC. If the company can maintain its RoE and RoIC, which they should if it is still a quality company, then the company will continue to compound its value even if the revenue growth slows.Growth in revenue, earnings and cash flow serve to aid in boosting value growth more exponentially.With regards to share price change which sort of governs your returns in the end, besides the growth in the value of the company, the change in market valuation of price multiple will be another factor.You can refer to the Compounding Triangle about this.", "How should one manage his portfolio? Capital gain vs cash flow?": "Depending on your cash flow needs, you can consider allocating a portion to income generating companies.Alternative, if initial companies invested in are quality asset light compounders, they could reach a stage whereby they start paying out dividends and doing share buyback due to being flush with cash. In this case, the best thing to do it to just keep holding on to them.Ultimately, it's up to you. The two considerations you might need to think about would be,How much cash flow you need for your lifestyle?When do you want to be financially free?From there you can map out how to transition your portfolio allocation over time. You can use the Financial Planner to plan this out.If capital base is small, the best is still to go for growth investing. Ideally your cash flow from other sources (eg. salary), should fund your lifestyle. You can refer to the answer here about considerations to take note of in your financial management.When your capital base grows larger, you can consider allocating a portion of your portfolio for income investing (eg. REITs).We can’t control the market and how the share price moves over the short term but we can control what we choose to invest. With proper framework and discipline application, the success probability is tip in your favor. Share price will always track the value of the company over the long term.Time and patience is needed for the company to improve its fundamentals. In the long term, the market will value the company accordingly and the share price will follow.To aid in this, it is why financial budgeting and management needs to be in place before you start investing.Never invest with money that you might need urgently. It is important to always have an emergency fund set aside.Do refer to the Financial Planner to aid you in this, and take note of these important considerations in your financial management.", "Portfolio allocation as one age or have more dependents?": "Depending on your cash flow needs, you can consider allocating a portion to income generating companies.Alternative, if initial companies invested in are quality asset light compounders, they could reach a stage whereby they start paying out dividends and doing share buyback due to being flush with cash. In this case, the best thing to do it to just keep holding on to them.Ultimately, it's up to you. The two considerations you might need to think about would be,How much cash flow you need for your lifestyle?When do you want to be financially free?From there you can map out how to transition your portfolio allocation over time. You can use the Financial Planner to plan this out.If capital base is small, the best is still to go for growth investing. Ideally your cash flow from other sources (eg. salary), should fund your lifestyle. You can refer to the answer here about considerations to take note of in your financial management.When your capital base grows larger, you can consider allocating a portion of your portfolio for income investing (eg. REITs).We can’t control the market and how the share price moves over the short term but we can control what we choose to invest. With proper framework and discipline application, the success probability is tip in your favor. Share price will always track the value of the company over the long term.Time and patience is needed for the company to improve its fundamentals. In the long term, the market will value the company accordingly and the share price will follow.To aid in this, it is why financial budgeting and management needs to be in place before you start investing.Never invest with money that you might need urgently. It is important to always have an emergency fund set aside.Do refer to the Financial Planner to aid you in this, and take note of these important considerations in your financial management.", "Any alternatives for cash flow since growth companies don’t pay dividends?": "Depending on your cash flow needs, you can consider allocating a portion to income generating companies.Alternative, if initial companies invested in are quality asset light compounders, they could reach a stage whereby they start paying out dividends and doing share buyback due to being flush with cash. In this case, the best thing to do it to just keep holding on to them.Ultimately, it's up to you. The two considerations you might need to think about would be,How much cash flow you need for your lifestyle?When do you want to be financially free?From there you can map out how to transition your portfolio allocation over time. You can use the Financial Planner to plan this out.If capital base is small, the best is still to go for growth investing. Ideally your cash flow from other sources (eg. salary), should fund your lifestyle. You can refer to the answer here about considerations to take note of in your financial management.When your capital base grows larger, you can consider allocating a portion of your portfolio for income investing (eg. REITs).We can’t control the market and how the share price moves over the short term but we can control what we choose to invest. With proper framework and discipline application, the success probability is tip in your favor. Share price will always track the value of the company over the long term.Time and patience is needed for the company to improve its fundamentals. In the long term, the market will value the company accordingly and the share price will follow.To aid in this, it is why financial budgeting and management needs to be in place before you start investing.Never invest with money that you might need urgently. It is important to always have an emergency fund set aside.Do refer to the Financial Planner to aid you in this, and take note of these important considerations in your financial management.", "For Singaporean, should we invest with our CPF or SRS?": "For new investors, just leave your CPF and SRS as it is. After all, you are already getting a returns far better than the local banks.Likewise, this is a source of retirement fund for you so it is best to let it be unless you know what you are doing.For those more experienced, you should consider deploying the CPF and SRS to purchase companies that can give better than 4%.No need to rush into it since CPF already giving good returns compare to banks so you can afford to wait for right valuation to enter.REITs is a good consideration.If you have yet to purchase your property, invest first using your CPF before using your CPF to buy your property as you are restricted to invest only 35% of your CPF.The dividends from your investment can further help to pay for your mortgage.For more details, you can refer tohttps://www.cpf.gov.sg/Members/Schemes/schemes/optimising-my-cpf/cpf-investment-schemeshttps://blog.moneysmart.sg/invest/cpf-investment-scheme-cpfis/https://www.sgmoneymatters.com/srs-account-investment-options/", "Is it better to purchase good local companies that pay a dividend yield of more than 4% returns or better to leave the CPF and SRS as it is?": "For new investors, just leave your CPF and SRS as it is. After all, you are already getting a returns far better than the local banks.Likewise, this is a source of retirement fund for you so it is best to let it be unless you know what you are doing.For those more experienced, you should consider deploying the CPF and SRS to purchase companies that can give better than 4%.No need to rush into it since CPF already giving good returns compare to banks so you can afford to wait for right valuation to enter.REITs is a good consideration.If you have yet to purchase your property, invest first using your CPF before using your CPF to buy your property as you are restricted to invest only 35% of your CPF.The dividends from your investment can further help to pay for your mortgage.For more details, you can refer tohttps://www.cpf.gov.sg/Members/Schemes/schemes/optimising-my-cpf/cpf-investment-schemeshttps://blog.moneysmart.sg/invest/cpf-investment-scheme-cpfis/https://www.sgmoneymatters.com/srs-account-investment-options/", "Micro cap companies are risky? GIM research covers mostly such smaller companies. According to macroeconomic trend and pattern, it was observed during Black Swan or market recession, most companies will be affected badly. First to recover would be the blue chip, then the mid-cap, last and probably won’t recover would be the micro-cap.": "These trends are sweeping statements. Yes, it is true that smaller companies might not survive downturn but that is due to flawed business models and likely poor balance sheets.Whether a company can be resilient and bounce back, or maybe not even affected much by the downturn is more inherently due to quality business model and robust balance sheet.This is why there is the GIM framework of PACS GASP to assess a company to determine if it is worth investing in.", "Primary factors of growth and how to spot them at an early stage?": "Check on Potential to Scale and Awesome Quality. These two should help gauge the growth capability and immediate potential ahead. They apply no matter which phase the company is at, whether they are a new startup or an established company that is looking to open new market segments.The difficulty might lie more in determining traction when the company is smaller and has yet to encounter any crisis situation.Spotting at an early stage can be done if within your Circle of Competence (CoC), and it will require some imagination on your part. However, do note to quantify your narrative.Some factors you can consider focusing on,Product-market fit. There is actual paid demand for the product and service.Essentialness of products and services. Company solves critical pain points for customers.Sales & marketing model to capture market fast. Great product means nothing if nobody knows about it.Revenue growth coupled with solid retention. Customers are happy to pay for it and to continue purchasing it going ahead.Solid customers review. At times, customers might even help to do marketing via word-of-mouth.Continuous Compounding is another important factor too but this is more for further extending of longer term runway. The most solid companies are those that can extend their runway indefinitely likely through innovations to create whole new markets.However, for early phase growth, key is more to determine the Potential to Scale and Awesome Quality.Of course, these are only the business model aspects.Other considerations will be on the management aspects, particularly their Growth Mindset and Purpose.These will determine what drives them to do what they envision to grow the company larger.Another important factor is in the Ability to Execute to gauge if the management have what it takes to deliver on what they say and thus turning their vision into reality.", "How to spot the right qualities in a competent management and owner-operator?": "There are multiple factors of consideration, drawing on from different sources to form that picture of whether the management behaves like an owner-operator.So do read the earnings calls and management sharing, search for their interview, read the letter to shareholders, and so on.Take note of the words they use and their thinking process.Do they understand their own business and are able to explain it simply? If they can't, then it is doubtful they even know what are the opportunities and threats ahead.Long term vision and also how to get there? They should be able to quantify it rather than just paint a vision.Capital allocation decision. They talk about growing the company but are paying dividends instead? Questionable.Compensation structure and skin-in-the-game. If they believe in growing the company, then they should have a stake in the company since that will be their source of wealth.Fundamental performance of company. No action and talk only (NATO)? Or do they execute what they say?Does management even write their own letter to shareholders? Check differences in style and their interview, earnings call and so on.You can read the book, Investing Between the Lines by L. J. Rittenhouse. Alternatively, you can refer to the sharing on the book done by the community.", "How to evaluate technology companies as it can be hard to understand? As we move towards digitization, understanding these businesses are through imagination, as it is hard to understand what goes behind. How should we approach them?": "First thing first, sticking to your Circle of Competence (CoC) is critical.You should never invest in something that you cannot understand, as you will then be unable to assess the company well with the GIM framework.How can you determine the addressable market, the quality, the risks and so on, if you cannot understand what the business is about?You do need to differentiate between understanding about the product and service, with understanding about the business.What you need is to understand how the business operates and the unit economics behind it, not so much the technology between the product and service.Ultimately, all businesses growth ahead is based on imagination and narrative. But to stay grounded, we need to quantify it with the financials and monitor the progress over time.We will seek to cover a variety of companies. So if certain companies you can’t understand even after the research, it’s best you don’t invest in them.There will be enough companies for you to choose from, hopefully, that you can still have a well diversified portfolio.For SaaS companies, you can refer to the Industry Insights on it.For the key metrics to evaluate SaaS, you can refer here.With regards to valuing SaaS companies, which can be unprofitable during its growth stage, you can refer to here.", "How to evaluate SaaS companies?": "First thing first, sticking to your Circle of Competence (CoC) is critical.You should never invest in something that you cannot understand, as you will then be unable to assess the company well with the GIM framework.How can you determine the addressable market, the quality, the risks and so on, if you cannot understand what the business is about?You do need to differentiate between understanding about the product and service, with understanding about the business.What you need is to understand how the business operates and the unit economics behind it, not so much the technology between the product and service.Ultimately, all businesses growth ahead is based on imagination and narrative. But to stay grounded, we need to quantify it with the financials and monitor the progress over time.We will seek to cover a variety of companies. So if certain companies you can’t understand even after the research, it’s best you don’t invest in them.There will be enough companies for you to choose from, hopefully, that you can still have a well diversified portfolio.For SaaS companies, you can refer to the Industry Insights on it.For the key metrics to evaluate SaaS, you can refer here.With regards to valuing SaaS companies, which can be unprofitable during its growth stage, you can refer to here.", "How to build conviction to invest in a company after thorough research? Sure we may have done research but how much more is necessarily enough after following the GIM framework?": "You should have a checklist and do the comparison between the companies in your watchlist to pick the best among those in your watchlist to invest. The GIM framework can serve as a checklist initially but you can improve your checklist over time.Some questions you can ask yourself before you even invest.Are you willing to hold this company long term?If the share price were to drop by 50% sometime in the future, assuming fundamental intact or improving, will you buy more?If you are not able to answer these two questions with confidence, you might have missed out on something about the company which you are unsure of.Alternatively, you should just set this company aside in your watchlist and not invest in it for now, while you proceed to look at other companies.", "After spending time on research, it feels wasted not to invest in the company?": "Assuming the company is good, it feels wasted to not invest in it after spending time researching about it. However, if this goes on, eventually the portfolio might have too many companies.To avoid this situation of having to invest in all good companies that you have researched on, you should do a comparison among those in your watchlist using a checklist.The GIM framework can be a good checklist initially but you should improve on it over time for yourself.Depending on capital size, you could only have 3 to 10 companies, so you have to choose properly.A company might be good but is it better than the others in your portfolio?If yes, you should sell the 'weakest' company in your portfolio and redeploy your capital to the better opportunity.If no, then just set it aside in your watchlist for now. You can return to looking at it later if there are new developments.", "Realised quite a few companies are proposing share/note offering. Is this a good thing? My understanding is that they are raising capital by taking advantage of the recent spike in price.": "It is a combination of a spike in share price plus the current low interest rate environment.So they can finance their company cheaply and possibly avoid diluting the share a lot as conversion price is set higher.If you need to raise $100 mil and share price $10, then the number of shares comes to be 10 mil assuming all convert.But if the share price was $100, then only 1 mil share needs to be issued. Therefore the dilution is lessened.As for whether good or bad, it depends what they do with the money they raise. Same concept applies such that the Return on Capital > Cost of capital.So if they raise money and do nothing or like use it to pay dividends, then it can be an issue.Paying off debt is ok especially if the previous debt is at higher interest. But best is that the money is deployed to grow, strengthen and widen the moat of the company and increase its cashflow generation ability.", "When do we use EBIT and when do we use EBITDA?": "EBITDA does not take into account Depreciation and Amortization which can inflate the actual earnings of the company, especially for those that are capital intensive and asset heavy. Even though there's no actual cash flowing out in the form of D&A, the actual value of the company assets is decreasing.So looking at EBIT is still better as depreciation and amortization are real expenses unless for certain cases where the companies are not asset heavy (technology companies, software companies), which you might want to make adjustments for.If unsure, stick to EBIT to be safe.", "I am confused between RoE and RoIC. When do we use RoE and when do we use RoIC?": "RoE (Return on Equity), is calculated as net income divided by equity. RoE is based on shareholder equity value (assets - liabilities). So basically if RoE is 15%, every $1 equity the company has on book value, it’s generating 15 cents of net income for the company.RoIC (Return on Invested Capital), is calculated as the sum of after-tax interest expense plus net income, divided by the sum of debt plus equity.RoIC is different in a sense that it’s measuring how well the company is at being a good capital allocator because it’s using the Invested Capital to generate returns.RoIC is indeed a better measure of the efficiency of the business operations in terms of the capital deployed. However, it does not measure the overall efficiency of the company as a whole and the returns you get.RoE will provide this measure instead (assume debt is conservative or no debt). Also, in a way RoE measures potential for continuous compounding.Eg. A company can have very high RoIC but very low RoE as it hoards a huge amount of cash that it does not deploy for any use.Yes, management does allocate capital well to gain high RoIC but it is not having opportunities to use the cash it has, resulting in low RoE.In such a case, it would be better to do share buyback or pay dividend.", "Should we use GAAP or non-GAAP?": "GAAP is the official reporting as required by regulation.Companies show non-GAAP usually to present a 'clearer' picture of how they might be growing.In a sense, it's the same as when we look at recurring profit margin for SaaS companies whereby we add S&M expenses back in, or for companies like Sea or JD, where we capitalize the R&D and amortize it for adjustment, etc.As for GAAP and non-GAAP, it depends on what you understand about the business model and whether those so called non-cash items can be adjusted out. Nothing wrong with non-GAAP but best to understand their adjustment to see whether it is logical. Companies have to disclose in the appendix how they arrive at the non-GAAP figures.Most companies like to use non-GAAP to present a nicer profitability picture but it may not be so.Some of the SaaS companies should do so as they are genuinely reinvesting to develop stronger competitive edge.", "What's the significance of GAAP results vs non-GAAP results?": "GAAP is the official reporting as required by regulation.Companies show non-GAAP usually to present a 'clearer' picture of how they might be growing.In a sense, it's the same as when we look at recurring profit margin for SaaS companies whereby we add S&M expenses back in, or for companies like Sea or JD, where we capitalize the R&D and amortize it for adjustment, etc.As for GAAP and non-GAAP, it depends on what you understand about the business model and whether those so called non-cash items can be adjusted out. Nothing wrong with non-GAAP but best to understand their adjustment to see whether it is logical. Companies have to disclose in the appendix how they arrive at the non-GAAP figures.Most companies like to use non-GAAP to present a nicer profitability picture but it may not be so.Some of the SaaS companies should do so as they are genuinely reinvesting to develop stronger competitive edge.", "If the Total Equity of a company is negative, is this good or no good?": "You have to check why the Total Equity is negative. When companies do share buyback often, it can result in negative Total Equity over time. Hence they have a lot of treasury stock sitting on the balance sheet. Total Equity being negative in this case is ok. So long as the business is able to grow their earning power over time.On the other hand, if the Total Equity becomes negative due to the company constantly losing money or being over leverage and burden with debt and liabilities, then this is no good. Do avoid such companies.", "Why does the GIM framework require the ratio to be at a certain level? Eg. Operating margin more than 8%, Net Debt / Equity < 0.4, etc.": "We basically back tested these quantitative criteria with the historical data of many companies. So most of the time, if a company doesn't do better than these numbers, the company is not performing well and ultimately the share price either remains stagnant or declines over time.Likewise, you can set the criteria higher but that will mean that during the screening process, some opportunities will get filtered out as they might be undergoing transformation so the financial metrics might not look as good.There is always the qualitative check that comes after quantitative filtering to ensure the company is great. So it is better to relax the screening criteria to view more potential opportunities and then further filter them with the qualitative checks of PACS GASP.", "For SaaS, the general guideline of the metric for churn rate being less than 5%, is this churn rate referring to customer churn (subscription churn)? Or is the 5% for dollar churn (gross revenue churn)? Which is more important?": "Both are important.Normally, we mention it more for dollar churn as most companies don't really disclose customer churn. These days, most companies just disclose the DBNR (dollar based net retention) rate. So 5% is more to the dollar churn part. Customer churn, unless the company disclose, it is hard to tell.So ideal is for DBNR rate to be > 100% which include revenue churn (hopefully not much customer churn but rather just customer cutting back on usage), plus up-sell and cross-sell revenue gain.There might be a chance for DBNR rate to go below 100% due to a crisis situation, but it is preferable that customers cut back on usage rather than totally churning away. As long as customers don't churn, then the rebound will see the company do well again as the economy recovers and customers increase usage or even opt for up-sell and cross-sell value add.", "It has been mentioned that RoE is more important than Net Income Margin. Company with a high RoE but low Net Income Margin is still considered a good company. Why is this so?": "As mentioned, a business model that uses high volume sales might still be a good business like Costco. The net income margin is low but it more than makes up with the very high volume of sales it does.RoE is more important because it shows how efficiently the management uses shareholder equity to generate profits. This measure the return you as an investor will get too. Just need to make sure the RoE is not inflated by debt.", "What % do we use to decide whether the company is dilutive with all these share issuance or share-based compensation (SBC)?": "Search in the 10K for eitherStock-based CompensationStock optionsShare-based compensationAs for whether dilutive, you can check on per share metric performance. This ideally should be increasing over time.No point seeing if revenue or operating income or FCF is growing. You also need to know your ownership of your portion of the company, did it grow.If a company FCF per share is deteriorating over time, even if FCF grew, due to share count increasing much faster, or other per share metric deteriorate like operating income per share, etc, then the market likely will sell the company down.This is dilutive in a sense as your portion of ownership of the company earning and cashflow is decreasing.", "Price/Book (PB) ratio is usually only used for assets play. What are some examples of asset play?": "Some examples of for use of PB are construction companies, property developers, oil and gas, and banks.Asset play can also apply partially to many companies. Even like McDonald, Walmart, etc.These companies might own prime real estate which normally aren't valued properly.Regulation does not require these companies to revalue the asset they have so normally you see the purchase value held in the balance sheet.But over time, prime real estate will increase in value which won't be reflected. Of course, it is a bit useless if companies have no intention to sell off the asset as they rely on it more for operational purposes.", "There are other valuation ratios like PE/RoTE (Return on Tangible Equity) (= PEG), is this financial metric only relevant for the banking industry?": "As for use of PE/RoTE which is somewhat similar to a modified PEG ratio, it is more applicable for banks as you want to see a clearer picture by removing intangible items like goodwill, preferred shares and so on.As stated, a bank's balance sheet is different from normal companies. Using RoE to measure might present a distorted view.Why we use RoTE (as in PE/RoTE) as a close substitute to growth (as in PEG) is because that is the return the company generates on the shareholder’s equity and thus it can be seen as how fast your capital is growing.", "How do I access the Teachable platform for FTI Community?": "Login to our Community Portal under Teachable from this link: https://courses.thefulltimeinvestor.comDo bookmark it for easier access in the future. Any new information will also be shared here, the past tutorial videos, webinar sharing, book club sharing, research tools and so on.", "Is there an app for Teachable?": "Teachable app is currently available only for iOS. They are still working on an Android version.You can download the app in the Apple Store.https://apps.apple.com/us/app/teachable-online-courses/id1177062376Guide:https://support.teachable.com/hc/en-us/articles/115000766167-Use-the-iOS-App-as-a-StudentHowever, to access Teachable with the mobile app, your Teachable account need to be myTeachable account. You can’t access with the mobile app using Teachable School account.To convert your account to myTeachable, do refer to the answer for ‘How can I convert Teachable School account to myTeachable’ below.", "Why can’t I access Teachable with the mobile app?": "Teachable app is currently available only for iOS. They are still working on an Android version.You can download the app in the Apple Store.https://apps.apple.com/us/app/teachable-online-courses/id1177062376Guide:https://support.teachable.com/hc/en-us/articles/115000766167-Use-the-iOS-App-as-a-StudentHowever, to access Teachable with the mobile app, your Teachable account need to be myTeachable account. You can’t access with the mobile app using Teachable School account.To convert your account to myTeachable, do refer to the answer for ‘How can I convert Teachable School account to myTeachable’ below.", "What is the difference between Teachable School account and myTeachable account?": "Teachable is an LMS platform whereby users can create their own online school site to host learning and educational materials.  In the past, students sign up at each Teachable school by creating a Teachable School account. However, this is tedious for students looking to sign up for contents at different schools since they need to create multiple accounts. myTeachable is a single sign-on account that can allow them to have only one account and yet access multiple different schools.For more details, including converting your account to myTeachable, you can refer to the guide here: https://support.teachable.com/hc/en-us/articles/115000359807-Using-myTeachable-Guide-for-Students", "How can I convert Teachable School account to myTeachable?": "Teachable is an LMS platform whereby users can create their own online school site to host learning and educational materials.  In the past, students sign up at each Teachable school by creating a Teachable School account. However, this is tedious for students looking to sign up for contents at different schools since they need to create multiple accounts. myTeachable is a single sign-on account that can allow them to have only one account and yet access multiple different schools.For more details, including converting your account to myTeachable, you can refer to the guide here: https://support.teachable.com/hc/en-us/articles/115000359807-Using-myTeachable-Guide-for-Students", "Where do I find the earning dates for listed companies?": "Watch the video https://courses.thefulltimeinvestor.com/courses/633329/lectures/11915080.Relevant links:https://www2.sgx.com/securities/company-announcementshttps://www.hkexnews.hk/index.htm", "What tools do you use to receive push notifications / keep tabs of info on companies in your portfolio? Eg. their earnings release, etc.": "You can make use of Google Alerts.Likewise ToS and IB got alert functions too.Also, you can go to the company website and put in your email for their IR alerts.", "What are the different forms companies submit and which do we get the information we want like quarterly report or insider ownership?": "10K - Annual report.10Q - Quarterly report.DEF14A - Ownership otherwise known as Proxy statements.4 - Insider trading and transaction.3 - Initial ownership.8K - Current Report means if there are any major changes to business like acquisitions, bankruptcies, etc.13D - Where it reveals who owns the most shares of the company.", "GIM calculator does not seem suitable for valuing SaaS companies. Is there any other sector that is not suitable as well for GIM calculator?": "GIM calculator generally suitable for most operating companies that might conform to standard accounting.The reason why it doesn't work for specific companies is mostly due to the 'distorted' financials.So cyclical companies with fluctuating financial over a period of time, would have issues as earning and revenue swing greatly.Investment holding, banking, insurance whereby the standard accounting statement is interpreted differently.SaaS too as the current accounting method doesn't work well. Not exactly just SaaS, but those companies in the early growth stage, whereby their financials are also somewhat distorted.When they reinvest heavily to grow, they could have negative earnings or very low profitability despite generating FCF and scaling up fast to capture the market.Therefore the quantitative aspect will fail using the GIM calculator.Unfortunately, it is hard to have an all-in-one calculator for investing purposes. Most differing businesses will require its own adjustments to the financial to make sense of what is happening. Even among SaaS companies, each company adjustment will differ based on understanding of its business model and its qualitative factors.", "Is there an investment calculator that can apply for all companies?": "GIM calculator generally suitable for most operating companies that might conform to standard accounting.The reason why it doesn't work for specific companies is mostly due to the 'distorted' financials.So cyclical companies with fluctuating financial over a period of time, would have issues as earning and revenue swing greatly.Investment holding, banking, insurance whereby the standard accounting statement is interpreted differently.SaaS too as the current accounting method doesn't work well. Not exactly just SaaS, but those companies in the early growth stage, whereby their financials are also somewhat distorted.When they reinvest heavily to grow, they could have negative earnings or very low profitability despite generating FCF and scaling up fast to capture the market.Therefore the quantitative aspect will fail using the GIM calculator.Unfortunately, it is hard to have an all-in-one calculator for investing purposes. Most differing businesses will require its own adjustments to the financial to make sense of what is happening. Even among SaaS companies, each company adjustment will differ based on understanding of its business model and its qualitative factors."}